





Network Working Group                               Luca Martini(Editor)
Internet Draft                                             Eric C. Rosen
Expiration Date: December 2005                       Cisco Systems, Inc.

Nasser El-Aawar                                              Giles Heron
Level 3 Communications, LLC.                                     Tellabs




                                                               June 2005


   Encapsulation Methods for Transport of Ethernet Over MPLS Networks


                 draft-ietf-pwe3-ethernet-encap-10.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.


   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups. Note that other
   groups may also distribute working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time. It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/1id-abstracts.html

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

Abstract

   An Ethernet Pseudowire (PW) is used to carry Ethernet/802.3 Protocol
   Data Units over an MPLS network. This enables service providers to
   offer "emulated" ethernet services over existing MPLS networks. This
   document specifies the encapsulation of Ethernet/802.3 PDUs within a
   pseudo wire. It also specifies the procedures for using a PW to



Martini, et al.                                                 [Page 1]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


   provide a "point-to-point ethernet" service.



Table of Contents

    1      Specification of Requirements  ..........................   3
    2      Introduction  ...........................................   3
    3      Details Specific to Particular Emulated Services  .......   6
    3.1    Ethernet Tagged Mode  ...................................   6
    3.2    Ethernet  ...............................................   6
    3.3    Ethernet Specific Interface Parameter Sub-TLV  ..........   7
    3.4    Generic Procedures  .....................................   7
    3.4.1  Raw Mode vs. Tagged Mode  ...............................   8
    3.4.2  MTU Management on the PE/CE Links  ......................   9
    3.4.3  Frame Ordering  .........................................   9
    3.4.4  Frame Error Processing  .................................   9
    3.4.5  IEEE 802.3x Flow Control Interworking  ..................   9
    3.5    PW Setup and Maintenance  ...............................  10
    3.6    Management  .............................................  10
    3.7    The Control Word  .......................................  10
    3.7.1  Setting the sequence number  ............................  11
    3.7.2  Processing the sequence number  .........................  11
    3.8    QoS Considerations  .....................................  12
    4      Security Considerations  ................................  13
    5      PSN MTU Requirements  ...................................  13
    6      IANA Considerations  ....................................  13
    7      Full Copyright Statement  ...............................  14
    8      Intellectual Property Statement  ........................  14
    9      Normative References  ...................................  15
   10      Informative References  .................................  15
   11      Editor Information  .....................................  16
   12      Author Information  .....................................  16
   13      Significant Contributors  ...............................  17
   Ap A    Interoperability Guidelines  ............................  19
   Ap B    QoS Details  ............................................  21















Martini, et al.                                                 [Page 2]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


1. Specification of Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119


2. Introduction

   An Ethernet Pseudowire (PW) allows Ethernet/802.3 Protocol Data Units
   (PDUs) to be carried over an MPLS network. In addressing the issues
   associated with carrying an Ethernet PDU over a Public Switched
   Network (PSN), this document assumes that a Pseudowire (PW) has been
   set up by using the LDP protocol as described in [PWE3-CTRL]. This
   may be via manual configuration, or a signaling protocol such as LDP,
   as defined in [PWE3-CTRL].

   In addition to the Ethernet PDU format used within the pseudo wire,
   this document discusses:

     - Procedures for using a PW in order to provide a pair of CEs with
       an emulated (point-to-point) ethernet service, including the
       procedures for the processing of PE-bound and CE-bound ethernet
       PDUs. [RFC3985]

     - Ethernet-specific QoS and security considerations

     - Inter-domain transport considerations for Ethernet PW

   The following two figures describe the reference models which are
   derived from [RFC3985] to support the Ethernet PW emulated services.




















Martini, et al.                                                 [Page 3]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


         |<-------------- Emulated Service ---------------->|
         |                                                  |
         |          |<------- Pseudo Wire ------>|          |
         |          |                            |          |
         |          |    |<-- PSN Tunnel -->|    |          |
         | PW End   V    V                  V    V  PW End  |
         V Service  +----+                  +----+  Service V
   +-----+    |     | PE1|==================| PE2|     |    +-----+
   |     |----------|............PW1.............|----------|     |
   | CE1 |    |     |    |                  |    |     |    | CE2 |
   |     |----------|............PW2.............|----------|     |
   +-----+  ^ |     |    |==================|    |     | ^  +-----+
         ^  |       +----+                  +----+     | |  ^
         |  |   Provider Edge 1         Provider Edge 2  |  |
         |  |                                            |  |
   Customer |                                            | Customer
   Edge 1   |                                            | Edge 2
            |                                            |
            |                                            |
    Attachment Circuit (AC)                    Attachment Circuit (AC)
    native ethernet service                    native ethernet service


      Figure 1: PWE3 Ethernet/VLAN Interface Reference Configuration

   The "emulated service" shown in Figure 1 is, strictly speaking, a
   bridged LAN; the PEs have MAC interfaces, consume MAC control frames,
   etc. However, the procedures specified herein only support the case
   in which there are two CEs on the "emulated LAN". Hence we refer to
   this service as "emulated point-to-point ethernet". Specification of
   the procedures for using pseudo wires to emulate LANs with more than
   two CEs are out of scope of the current document.

   +-------------+                                +-------------+
   |  Emulated   |                                |  Emulated   |
   |  Ethernet   |                                |  Ethernet   |
   | (including  |         Emulated Service       | (including  |
   |  VLAN)      |<==============================>|  VLAN)      |
   |  Services   |                                |  Services   |
   +-------------+           Pseudo Wire          +-------------+
   |Demultiplexer|<==============================>|Demultiplexor|
   +-------------+                                +-------------+
   |    PSN      |            PSN Tunnel          |    PSN      |
   |   MPLS      |<==============================>|   MPLS      |
   +-------------+                                +-------------+
   |  Physical   |                                |  Physical   |
   +-----+-------+                                +-----+-------+




Martini, et al.                                                 [Page 4]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


      Figure 2: Ethernet PWE3 Protocol Stack Reference Model

   For the purpose of this document, PE1 will be defined as the ingress
   router, and PE2 as the egress router. A layer 2 PDU will be received
   at PE1, encapsulated at PE1, transported, decapsulated at PE2, and
   transmitted out on the attachment circuit of PE2.

   An Ethernet PW emulates a single Ethernet link between exactly two
   endpoints. The mechanisms described in this document are agnostic to
   that which is beneath the "Pseudo Wire" level in Figure 2, concerning
   itself only with the "Emulated Service" portion of the stack.

   The following reference model describes the termination point of each
   end of the PW within the PE:

           +-----------------------------------+
           |                PE                 |
   +---+   +-+  +-----+  +------+  +------+  +-+
   |   |   |P|  |     |  |PW ter|  | PSN  |  |P|
   |   |<==|h|<=| NSP |<=|minati|<=|Tunnel|<=|h|<== From PSN
   |   |   |y|  |     |  |on    |  |      |  |y|
   | C |   +-+  +-----+  +------+  +------+  +-+
   | E |   |                                   |
   |   |   +-+  +-----+  +------+  +------+  +-+
   |   |   |P|  |     |  |PW ter|  | PSN  |  |P|
   |   |==>|h|=>| NSP |=>|minati|=>|Tunnel|=>|h|==> To PSN
   |   |   |y|  |     |  |on    |  |      |  |y|
   +---+   +-+  +-----+  +------+  +------+  +-+
           |                                   |
           +-----------------------------------+
                   ^        ^          ^
                   |        |          |
                   A        B          C

           Figure 3: PW reference diagram

   The PW terminates at a logical port within the PE, defined at point A
   in the above diagram. This port provides an Ethernet MAC service that
   will deliver each Ethernet frame that is received at point A,
   unaltered, to the point A in the corresponding PE at the other end of
   the PW.

   The Native Service Processing (NSP) function includes frame
   processing that is required for the Ethernet frames that are
   forwarded to the PW termination point. Such functions may include
   stripping, overwriting or adding VLAN tags, physical port
   multiplexing and demultiplexing, PW-PW bridging, L2 encapsulation,
   shaping, policing, etc. These functions are specific to the native



Martini, et al.                                                 [Page 5]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


   frame technology , and may not be required for the PW emulation
   service.

   The points to the left of A, including the physical layer between the
   CE and PE, and any adaptation (NSP) functions between it and the PW
   terminations, are outside of the scope of PWE3 and are not defined
   here.

   "PW Termination", between A and B, represents the operations for
   setting up and maintaining the PW, and for encapsulating and
   decapsulating the Ethernet frames as necessary to trasmit them across
   the MPLS network.

   An ethernet PW operates in one of two modes: "raw mode" or "tagged
   mode". In tagged mode, each frame MUST contain an 802.1Q VLAN tag,
   and the tag value is meaningful to the NSPs at the two PW termination
   points. That is, the two PW termination points must have some
   agreement (signaled or manually configured) on how to process the
   tag. On a raw mode PW, a frame MAY contain an 802.1Q VLAN tag, but if
   it does, the tag is not meaningful to the NSPs, and passes
   transparently through them.


3. Details Specific to Particular Emulated Services

3.1. Ethernet Tagged Mode

   The Ethernet frame will be encapsulated according to the procedures
   defined in this document "tagged mode". It should be noted that if
   the VLAN identifier is modified by the egress PE, the Ethernet
   spanning tree protocol might fail to work properly. If the PE detects
   a failure on the Ethernet physical port, or the port is
   administratively disabled, it MUST send PW status notification
   message for all PWs associated with the port. This mode uses
   service-delimiting tags to map input ethernet frames to respective
   PWs and is corresponds to PW type 0x0004 "Ethernet Tagged Mode"
   [IANA].


3.2. Ethernet

   The Ethernet frame will be encapsulated according to the procedures
   defined in this document "raw mode". If the PE detects a failure on
   the Ethernet input port, or the port is administratively disabled,
   the PE MUST send an appropriate PW status notification message to the
   corresponding remote PE.  In this mode all ethernet frames received
   on the attachment circuit of PE1 will be transmitted to PE2 on a
   single PW.This service corresponds to PW type 0x0005 "Ethernet"



Martini, et al.                                                 [Page 6]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


   [IANA].


3.3. Ethernet Specific Interface Parameter Sub-TLV

   This sub-TLV specifies interface specific parameters. When
   applicable, it MUST be used to validate that the PEs, and the ingress
   and egress ports at the edges of the circuit, have the necessary
   capabilities to interoperate with each other. The Interface parameter
   TLV is defined in [PWE3-CTRL], the IANA registry with initial values
   for interface parameter sub-TLV types is defined in [IANA], but the
   ethernet specific interface paramenters are specified as follows:
     - 0x06 Requested VLAN ID Sub-TLV

       An Optional 16 bit value indicating the requested VLAN ID. This
       parameter MUST be used by a PE that is incapable of rewriting the
       802.1Q ethernet VLAN tag on output. If the ingress PE receives
       this request, it MUST rewrite the VLAN ID tag at the input to
       match the requested VLAN ID. If this is not possible, and the
       VLAN ID does not already match the configured ingress VLAN ID,
       the PW MUST not be enabled. This parameter is applicable only to
       PW type 4.


3.4. Generic Procedures

   When the NSP/Forwarder hands a frame to the PW termination function:

     - The preamble (if any) and FCS are stripped off.

     - The control word as defined in the "The Control Word" section is,
       if necessary, prepended to the resulting frame. The conditions
       under which the control word is or is not used are specified
       below.

     - The proper Pseudowire demultiplexor ( PW Label ) is prepended to
       the resulting packet.

     - The proper tunnel encapsulation is prepended to the resulting
       packet.

     - The packet is transmitted.

   The way in which the proper tunnel encapsulation and pseudo wire
   demultiplexor are chosen depends on the procedures that were used to
   set up the pseudo wire.

   When a packet arrives over a PW, the tunnel encapsulation and PW



Martini, et al.                                                 [Page 7]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


   demultiplexor are stripped off. If the control word is present, it is
   processed and stripped off. The resulting frame is then handed to the
   Forwarder/NSP. Regeneration of the FCS is considered to be an NSP
   responsibility.


3.4.1. Raw Mode vs. Tagged Mode

   When the PE receives an ethernet frame, and the frame has a VLAN tag,
   we can distinguish two cases:

      1. The tag is "service-delimiting". This means that the tag was
         placed on the frame by some piece of service provider-operated
         equipment, and the tag is used by the service provider to
         distinguish the traffic. For example, LANs from different
         customers might be attached to the same service provider
         switch, which applies VLAN tags to distinguish one customer's
         traffic from another's, and then forwards the frames to the PE.

      2. The tag is not service-delimiting. This means that the tag was
         placed in the frame by a piece of customer equipment, and is
         not meaningful to the PE.

   If an ethernet PW is operating in raw mode, service-delimiting tags
   are NEVER sent over the PW. If a service-delimiting tag is present
   when the frame is received from attachment circuit by the PE, it MUST
   be stripped (by the NSP) from the frame before the frame is sent to
   the PW.

   If an ethernet PW is operating in tagged mode, every frame sent on
   the PW MUST have a service-delimiting VLAN tag. If the frame as
   received by the PE from the attachment circuit does not have a
   service-delimiting VLAN tag, the PE must prepend the frame with a
   dummy VLAN tag before sending the frame on the PW. This is the
   default operating mode. This is the only REQUIRED mode.

   In both modes, non-service-delimiting tags are passed transparently
   across the PW as part of the payload. It should be noted that a
   single ethernet packet may contain more then one tag. None of these
   tags may be service-delimiting, otherwise only one of these tags may
   be service-delimiting. In any case the NSP function may only inspect
   the outer most tag for the purpose of adapting the ethernet frame to
   the pseudo wire.

   In both modes, the service-delimiting tag values have only local
   significance, i.e., are meaningful only at a particular PE-CE
   interface.  When tagged mode is used, the PE that receives a frame
   from the PW may rewrite the tag value, or may strip the tag entirely,



Martini, et al.                                                 [Page 8]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


   or may leave the tag unchanged, depending on its configuration. When
   raw mode is used, the PE that receives a frame may or may not need to
   add a service-delimiting tag before transmitting the frame on the
   attachment circuit; however it MUST not rewrite or remove any tags
   which are already present.


3.4.2. MTU Management on the PE/CE Links

   The Ethernet PW MUST NOT be enabled unless it is known that the MTUs
   of the CE-PE links are the same at both ends of the PW.


3.4.3. Frame Ordering

   In general, applications running over Ethernet do not require strict
   frame ordering. However the IEEE definition of 802.3 [802.3] requires
   that frames from the same conversation are delivered in sequence.
   Moreover, the PSN cannot (in the general case) be assumed to provide
   or to guarantee frame ordering.  An ethernet PW can, through use of
   the control word, provide strict frame ordering. If this option is
   enabled, any frames which get misordered by the PSN will be dropped
   by the receiving PW endpoint. If strict frame ordering is a
   requirement for a particular PW, this option MUST be enabled.


3.4.4. Frame Error Processing

   An encapsulated Ethernet frame traversing a psuedo-wire may be
   dropped, corrupted or delivered out-of-order. As described in [PWE3-
   REQ], frame-loss, corruption, and out-of-order delivery is considered
   to be a "generalized bit error" of the psuedo-wire. PW frames that
   are corrupted will be detected at the PSN layer and dropped.

   At the ingress of the PW the native Ethernet frame error processing
   mechanisms MUST be enabled. Therefore, if a PE device receives an
   Ethernet frame containing hardware level CRC errors, framing errors,
   or a runt condition, the frame MUST be discarded on input. Note that
   defining this processing is part of the NSP function and is outside
   the scope of this document.


3.4.5. IEEE 802.3x Flow Control Interworking

   In a standard gigabit Ethernet network, the flow control mechanism is
   optional and typically configured between the two nodes on a point-
   to-point link (e.g. between the CE and the PE). IEEE 802.3x PAUSE
   frames MUST NOT be carried across the PW. See Appendix A for notes on



Martini, et al.                                                 [Page 9]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


   CE-PE flow control.


3.5. PW Setup and Maintenance

   This document assumes that a mechanism exists to set up the ethernet
   PW.  Maintenance of the PW (e.g. keepalives, status updates, etc) is
   generally tied closely to the PW Setup mechanisms. [PWE3-CTRL] and
   [L2TPv3] define two mechanisms for setup and maintenance of Ethernet
   PWs.


3.6. Management

   The Ethernet PW management model follows the general management
   defined in [RFC3985] and [PWE3-MIB]. Many common PW management
   facilities are provided here, with no additional Ethernet specifics
   necessary.  Ethernet-specific parameters are defined in an additional
   MIB module, [PW-MIB].


3.7. The Control Word

   When carrying Ethernet over an MPLS backbone, sequentiality may need
   to be preserved.  The OPTIONAL control word defined here addresses
   this requirement.  Implementations MUST support sending no control
   word, and MAY support sending a control word.

   In all cases the egress router must be aware of whether the ingress
   router will send a control word over a specific virtual circuit. This
   may be achieved by configuration of the routers, or by signaling, as
   defined in [PWE3-CTRL].

   The control word is defined as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |0 0 0 0|   Reserved            |       Sequence Number         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   In the above diagram the first 4 bits MUST be set to 0 to indicate PW
   data.  The rest of the first 16 bits are reserved for future use.
   They MUST be set to 0 when transmitting, and MUST be ignored upon
   receipt.

   The next 16 bits provide a sequence number that can be used to
   guarantee ordered frame delivery. The processing of the sequence



Martini, et al.                                                [Page 10]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


   number field is OPTIONAL.

   The sequence number space is a 16 bit, unsigned circular space. The
   sequence number value 0 is used to indicate that the sequence number
   check alghorithm is not used.


3.7.1. Setting the sequence number

   For a given PW, and a pair of routers PE1 and PE2, if PE1 supports
   frame sequencing then the following procedures should be used:

     - the initial frame transmitted on the PW MUST use sequence number
       1
     - subsequent frames MUST increment the sequence number by one for
       each frame
     - when the transmit sequence number reaches the maximum 16 bit
       value (65535) the sequence number MUST wrap to 1

   If the transmitting router PE1 does not support sequence number
   processing, then the sequence number field in the control word MUST
   be set to 0.


3.7.2. Processing the sequence number

   If a router PE2 supports receive sequence number processing, then the
   following procedures should be used:

   When a PW is initially set up, the "expected sequence number"
   associated with it MUST be initialized to 1.

   When a frame is received on that PW, the sequence number should be
   processed as follows:

     - if the sequence number on the frame is 0, then the sequence
       number check is skipped. ( sequence check disabled )

     - otherwise if the frame sequence number >= the expected sequence
       number and the frame sequence number - the expected sequence
       number < 32768, then the frame is in order.

     - otherwise if the frame sequence number < the expected sequence
       number and the expected sequence number - the frame sequence
       number >= 32768, then the frame is in order.






Martini, et al.                                                [Page 11]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


     - otherwise the frame is out of order.

   If a frame passes the sequence number check, or is in order then, it
   can be delivered immediately. If the frame is in order, then the
   expected sequence number should be set using the algorithm:

   expected_sequence_number := frame_sequence_number + 1 mod 2**16
   if (expected_sequence_number = 0) then expected_sequence_number := 1;

   Packets which are received out of order MAY be dropped or reordered
   at the discretion of the receiver.

   If a PE router negotiated not to use receive sequence number
   processing, and it received a non zero sequence number, then it
   SHOULD send a PW status message indicating a receive fault, and
   disable the PW.


3.8. QoS Considerations

   The ingress PE MAY consider the user priority (PRI) field [802.1Q] of
   the VLAN tag header when determining the value to be placed in a QoS
   field of the encapsulating protocol (e.g., the EXP fields of the MPLS
   label stack).  In a similar way, the egress PE MAY consider the QoS
   field of the PSN's encapsulating protocol when queuing the frame for
   CE-bound.

   A PE MUST support the ability to carry the Ethernet PW as a best
   effort service over the PSN.  PRI bits are kept transparent between
   PE devices, regardless of the QoS support of the PSN.

   If an 802.1Q VLAN field is added at the PE, a default PRI setting of
   zero MUST be supported, a configured default value is recommended, or
   the value may be mapped from the QoS field of the PSN, as referred to
   above.

   A PE may support additional QoS support by means of one or more of
   the following methods:

        -i. One COS per PW End Service (PWES), mapped to a single COS PW
            at the PSN.
       -ii. Multiple COS per PWES mapped to a single PW with multiple
            COS at the PSN.
      -iii. Multiple COS per PWES mapped to multiple PWs at the PSN.

   Examples of the cases above and details of the service mapping
   considerations are described in Appendix B.




Martini, et al.                                                [Page 12]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


   The PW guaranteed rate at the PSN level is PW provider policy based
   on agreement with the customer, and may be different from the
   Ethernet physical port rate.


4. Security Considerations

   The ethernet pseudo wire type is subject to all of the general
   security considerations discussed in [RFC3985][PWE3-CTRL].

   The ethernet pseudo wire is transported on a MPLS PSN, therefore the
   security of the pseudo wire itself will only be as good as the
   security of the MPLS PSN. The MPLS PSN can be secured by various
   methods, as described in [RFC3031].

   Security achieved by access control of MAC addresses is out of scope
   of this document. Additional security requirements related to the use
   of PW in a switching (virtual bridging) environment are not discussed
   here as they are not within the scope of this document.


5. PSN MTU Requirements

   The PSN MUST be configured with an MTU that is large enough to
   transport a maximum sized ethernet frame which has been encapsulated
   with a control word, a pseudo wire demultiplexor, and a tunnel
   encapsulation.  If MPLS is used as the tunneling protocol, for
   example, this is likely to be 8 or more bytes greater than the
   largest frame size. Other tunneling protocols may have longer headers
   and require larger MTUs. If the ingress router determines that an
   encapsulated layer 2 PDU exceeds the MTU of the tunnel through which
   it must be sent, the PDU MUST be dropped. If an egress router
   receives an encapsulated layer 2 PDU whose payload length (i.e., the
   length of the PDU itself without any of the encapsulation headers),
   exceeds the MTU of the destination layer 2 interface, the PDU MUST be
   dropped.


6. IANA Considerations

   This document has no IANA Actions.










Martini, et al.                                                [Page 13]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


7. Full Copyright Statement

   Copyright (C) The Internet Society (2005).  This document is subject
   to the rights, licenses and restrictions contained in BCP 78, and
   except as set forth therein, the authors retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


8. Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at ietf-
   ipr@ietf.org.

   By submitting this Internet-Draft, I certify that any applicable
   patent or other IPR claims of which I am aware have been disclosed,
   or will be disclosed, and any of which I become aware will be
   disclosed, in accordance with RFC 3668.








Martini, et al.                                                [Page 14]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


9. Normative References

   [PWE3-CW] "PWE3 Control Word for use over an MPLS PSN", S. Bryant,
        G. Swallow, D. McPherson, draft-ietf-pwe3-cw-01.txt, ( work in
        progress ), December 2004.
        [IANA] "IANA Allocations for pseudo Wire Edge to Edge Emulation
        (PWE3)" Martini,Townsley, draft-ietf-pwe3-iana-allocation-08.txt
        (work in progress), April 2004

   [PWE3-CTRL] "Transport of Layer 2 Frames Over MPLS", Martini L.,et al
        draft-ietf-pwe3-control-protocol-09.txt, ( work in progress ),
        September 2004.
        [RFC3031] E. Rosen, et al., RFC 3031, MPLS Architecture, January
        2001.


10. Informative References

   [RFC3985] "PWE3 Architecture" Bryant, et al., RFC3985.

   [PWE3-REQ] "Requirements for Pseudo Wire Emulation Edge-to-Edge",
        Xiao, X., McPherson, D., Pate, P., White, C., Kompella,
        K., Gill,  V., Nadeau, T., draft-ietf-pwe3-requirements-08.txt,
        (work in progress), September 2003.

   [PW-MIB] "Pseudo Wire (PW) Management Information Base
        using SMIv2", Zelig, D., Mantin, S., Nadeau, T., Danenberg,
        D., draft-ietf-pwe3-pw-mib-04.txt, (work in progress),
        February 2004.

   [802.3] IEEE, ISO/IEC 8802-3: 2000 (E), "IEEE Standard
        for Information technology -- Telecommunications and
        information exchange between systems -- Local and metropolitan
         area networks -- Specific requirements -- Part 3: Carrier
        Sense Multiple Access with Collision Detection (CSMA/CD)
        Access Method and Physical Layer Specifications", 2000.

   [802.1Q] ANSI/IEEE Standard 802.1Q, "IEEE Standards for
        Local and Metropolitan Area Networks: Virtual Bridged
        Local Area Networks", 1998.











Martini, et al.                                                [Page 15]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


11. Editor Information


   Luca Martini
   Cisco Systems, Inc.
   9155 East Nichols Avenue, Suite 400
   Englewood, CO, 80112
   e-mail: lmartini@cisco.com



12. Author Information


   Nasser El-Aawar
   Level 3 Communications, LLC.
   1025 Eldorado Blvd.
   Broomfield, CO, 80021
   e-mail: nna@level3.net


   Giles Heron
   Tellabs
   Abbey Place
   24-28 Easton Street
   High Wycombe
   Bucks
   HP11 1NT
   UK
   e-mail: giles.heron@tellabs.com


   Eric C. Rosen
   Cisco Systems, Inc.
   1414 Massachusetts Avenue
   Boxborough, MA 01719
   e-mail: erosen@cisco.com














Martini, et al.                                                [Page 16]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


13. Significant Contributors


   Andrew G. Malis
   Tellabs
   90 Rio Robles Dr.
   San Jose, CA 95134
   e-mail: Andy.Malis@tellabs.com


   Dan Tappan
   Cisco Systems, Inc.
   1414 Massachusetts Avenue
   Boxborough, MA 01719
   e-mail: tappan@cisco.com


   Steve Vogelsang
   Laurel Networks, Inc.
   Omega Corporate Center
   1300 Omega Drive
   Pittsburgh, PA 15205
   e-mail: sjv@laurelnetworks.com


   Vinai Sirkay
   Reliance Infocomm
   Dhirubai Ambani Knowledge City
   Navi Mumbai 400 709
   India
   e-mail: vinai@sirkay.com


   Vasile Radoaca
   Nortel Networks
   600  Technology Park
   Billerica MA 01821
   e-mail: vasile@nortelnetworks.com


   Chris Liljenstolpe
   Alcatel
   11600 Sallie Mae Dr.
   9th Floor
   Reston, VA 20193
   e-mail: chris.liljenstolpe@alcatel.com





Martini, et al.                                                [Page 17]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005



   Kireeti Kompella
   Juniper Networks
   1194 N. Mathilda Ave
   Sunnyvale, CA 94089
   e-mail: kireeti@juniper.net


   Tricci So
   Nortel Networks 3500 Carling Ave.,
   Nepean, Ontario,
   Canada, K2H 8E9.
   e-mail: tso@nortelnetworks.com


   XiPeng Xiao
   Riverstone Networks
   5200 Great America Parkway
   Santa Clara, CA 95054
   e-mail: xxiao@riverstonenet.com


   Christopher O.  Flores
   T-Systems
   10700 Parkridge Boulevard
   Reston, VA 20191
   USA
   e-mail: christopher.flores@usa.telekom.de


   David Zelig
   Corrigent Systems
   126, Yigal Alon St.
   Tel Aviv, ISRAEL
   e-mail: davidz@corrigent.com


   Raj Sharma
   Luminous Netwokrs, Inc.
   10460 Bubb Road
   Cupertino, CA 95014
   e-mail: raj@luminous.com









Martini, et al.                                                [Page 18]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005



   Nick Tingle
   TiMetra Networks
   274 Ferguson Drive
   Mountain View, CA 94043
   e-mail: nick@timetra.com


   Sunil Khandekar
   TiMetra Networks
   274 Ferguson Drive
   Mountain View, CA 94043
   email: sunil@timetra.com


   Loa Andersson
   TLA-group
   e-mail: loa@pi.se



Ap A Interoperability Guidelines

Configuration Options

   The following is a list of the configuration options for a point-to-
   point Ethernet PW based on the reference points of Figure 3:
























Martini, et al.                                                [Page 19]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


   --------------|---------------|---------------|------------------
   Service and   |  Encap on C   |Operation at B | Remarks
   Encap on A    |               |ingress/egress |
   --------------|---------------|---------------|------------------
   1) Raw        | Raw - Same as |               |
                 | A             |               |
                 |               |               |
   --------------|---------------|---------------|------------------
   2) Tag1       | Tag2          |Optional change| VLAN can be
                 |               |of VLAN value  | 0-4095
                 |               |               | Change allowed in
                 |               |               | both directions
   --------------|---------------|---------------|------------------
   3) No Tag     | Tag           |Add/remove Tag | Tag can be
                 |               |field          | 0-4095
                 |               |               | (note i)
                 |               |               |
   --------------|---------------|---------------|------------------
   4) Tag        | No Tag        |Remove/add Tag | (note ii)
                 |               |field          |
                 |               |               |
                 |               |               |
   --------------|---------------|---------------|------------------

                Figure 4: Configuration Options

   Allowed combinations:

   Raw and other services are not allowed on the same NSP virtual port
   (A). All other combinations are allowed, except that conflicting
   VLANs on (A) are not allowed. Note that in most point-to-point PW
   application the NSP virtual port is the same entity as the physical
   port.

   Notes:

        -i. Mode #3 MAY be limited to adding VLAN NULL only, since
            change of VLAN or association to specific VLAN can be done
            at the PW CE-bound side.

       -ii. Mode #4 exists in layer 2 switches, but is not recommended
            when operating with PW since it may not preserve the user's
            PRI bits.  If there is a need to remove the VLAN tag (for
            TLS at the other end of the PW) it is recommended to use
            mode #2 with tag2=0 (NULL VLAN) on the PW and use mode #3 at
            the other end of the PW.





Martini, et al.                                                [Page 20]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


IEEE 802.3x Flow Control Considerations

   If the receiving node becomes congested, it can send a special frame,
   called the PAUSE frame, to the source node at the opposite end of the
   connection. The implementation MUST provide a mechanism for
   terminating PAUSE frames locally (i.e. at the local PE). It MUST
   operate as follows:

   PAUSE frames received on a local Ethernet port SHOULD cause the PE
   device to buffer, or to discard, further Ethernet frames for that
   port until the PAUSE condition is cleared.  Optionally, the PE MAY
   simply discard PAUSE frames.

   If the PE device wishes to pause data received on a local Ethernet
   port (perhaps because its own buffers are filling up or because it
   has received notification of congestion within the PSN) then it MAY
   issue a PAUSE frame on the local Ethernet port, but MUST clear this
   condition when willing to receive more data.


Ap B QoS Details

   Section 3.7 describes various modes for supporting PW QOS over the
   PSN.  Examples of the above for a point to point VLAN service are:

     - The classification to the PW is based on VLAN field only,
       regardless of the user PRI bits.  The PW is assigned a specific
       COS (marking, scheduling, etc.)  at the tunnel level.

     - The classification to the PW is based on VLAN field, but the PRI
       bits of the user is mapped to different COS marking (and network
       behavior) at the PW level.  Examples are and E-LSP in an MPLS
       network.

     - The classification to the PW is based on VLAN field and the PRI
       bits, and frames with different PRI bits are mapped to different
       PWs. An example is to map a PWES to different L-LSPs in MPLS PSN
       in order to support multiple COS over an L-LSP capable network,
       or to multiple L2TPv3 sessions [L2TPv3].

       The specific value to be assigned at the PSN for various COS is
       out of scope for this document.









Martini, et al.                                                [Page 21]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


Adaptation of 802.1Q COS to PSN COS

   It is not required that the PSN will have the same COS definition of
   COS as defined in [802.1Q], and the mapping of 802.1Q COS to PSN COS
   is application specific and depends on the agreement between the
   customer and the PW provider.  However, the following principles
   adopted from 802.1Q table 8-2 MUST be met when applying set of PSN
   COS based on user's PRI bits.

                ----------------------------------
                |#of available classes of service|
   -------------||---+---+---+---+---+---+---+---|
   User         || 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |
   Priority     ||   |   |   |   |   |   |   |   |
   ===============================================
   0 Best Effort|| 0 | 0 | 0 | 1 | 1 | 1 | 1 | 2 |
   (Default)    ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   1 Background || 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
                ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   2 Spare      || 0 | 0 | 0 | 0 | 0 | 0 | 0 | 1 |
                ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   3 Excellent  || 0 | 0 | 0 | 1 | 1 | 2 | 2 | 3 |
   Effort       ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   4 Controlled || 0 | 1 | 1 | 2 | 2 | 3 | 3 | 4 |
   Load         ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   5 Interactive|| 0 | 1 | 1 | 2 | 3 | 4 | 4 | 5 |
   Multimedia   ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   6 Interactive|| 0 | 1 | 2 | 3 | 4 | 5 | 5 | 6 |
   Voice        ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|
   7 Network    || 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 |
   Control      ||   |   |   |   |   |   |   |   |
   ------------ ||---+---+---+---+---+---+---+---|

                Figure 5: IEEE 802.1Q COS Service Mapping










Martini, et al.                                                [Page 22]

Internet Draft   draft-ietf-pwe3-ethernet-encap-10.txt         June 2005


Drop precedence

   The 802.1P standard does not support drop precedence, therefore from
   the PW PE-bound point of view there is no mapping required.  It is
   however possible to mark different drop precedence for different PW
   frames based on the operator policy and required network behavior.
   This functionality is not discussed further here.

   PSN QOS support and signaling of QOS is out of scope of this
   document.









































Martini, et al.                                                [Page 23]

